{
  "text": "Hello and welcome to The English We Speak where we explain phrases used by fluent English speakers so that you can use them too. I'm Feifei. And I'm Phil. What were you doing this morning? I didn't see you in the office, Phil. Oh, I was helping a friend design their website. I've been studying design. Design skills? I didn't realise you had that in your locker. My locker? I think this could be the expression we learn in this programme. If you have something in your locker, you have a skill, idea or something that you can use if needed. It's not usually about your actual locker where you leave your things. No. It's often something that other people don't know about, like your design skills. They're definitely useful to have in your locker. Now, the important thing is that they are something that you can bring out of your locker and use when needed. For example, if you're going to a job interview, it's good to have some examples of your work in your locker. Do you have anything in your locker to help people understand this expression, Phil? Well, I've got some examples of people using the expression. Let's listen. Everyone looked really bored with my karaoke song choices, but then I remembered I had a really good party song in my locker. Everyone got up and danced. I didn't realise you had those dance moves in your locker. I wouldn't have challenged you to a dance off if I'd known. So I've invited my colleagues over for dinner. They think I can't cook, but they're going to be surprised because I've got some great pasta recipes in my locker. We've been learning the expression have in your locker. It means having something extra you can use if needed. And there is a similar expression, to have one shot in your locker. This means you only have one chance left to do something. Yes, think about researchers who've been trying to make an experiment work and there's only one more chance to succeed. They would have one more shot in their locker. Now, I'm sure you want to have some great English expressions in your locker. So make sure you come back next time to learn a new one. Bye. Bye. Hello. Want to improve your pronunciation? Our new video series, The Pronunciation Lounge, helps you hear, recognise and produce English sounds, words and phrases. Find all the episodes on our website and practice your listening and speaking skills.",
  "segments": [
    {
      "id": 0,
      "start": 0,
      "end": 6.7,
      "text": " Hello and welcome to The English We Speak where we explain phrases used by fluent English speakers"
    },
    {
      "id": 1,
      "start": 6.8,
      "end": 12.86,
      "text": " so that you can use them too. I'm Feifei. And I'm Phil. What were you doing this morning?"
    },
    {
      "id": 2,
      "start": 12.96,
      "end": 17.34,
      "text": " I didn't see you in the office, Phil. Oh, I was helping a friend design their website."
    },
    {
      "id": 3,
      "start": 17.44,
      "end": 23.5,
      "text": " I've been studying design. Design skills? I didn't realise you had that in your locker."
    },
    {
      "id": 4,
      "start": 23.6,
      "end": 27.68,
      "text": " My locker? I think this could be the expression we learn in this programme."
    },
    {
      "id": 5,
      "start": 28.24,
      "end": 34.62,
      "text": " If you have something in your locker, you have a skill, idea or something that you can use if"
    },
    {
      "id": 6,
      "start": 34.72,
      "end": 39.02,
      "text": " needed. It's not usually about your actual locker where you leave your things."
    },
    {
      "id": 7,
      "start": 39.12,
      "end": 44.38,
      "text": " No. It's often something that other people don't know about, like your design skills."
    },
    {
      "id": 8,
      "start": 44.480000000000004,
      "end": 49.82,
      "text": " They're definitely useful to have in your locker. Now, the important thing is that they are something"
    },
    {
      "id": 9,
      "start": 49.92,
      "end": 55.66,
      "text": " that you can bring out of your locker and use when needed. For example, if you're going to a job"
    },
    {
      "id": 10,
      "start": 55.76,
      "end": 60.22,
      "text": " interview, it's good to have some examples of your work in your locker. Do you have anything"
    },
    {
      "id": 11,
      "start": 60.32,
      "end": 65.34,
      "text": " in your locker to help people understand this expression, Phil? Well, I've got some examples"
    },
    {
      "id": 12,
      "start": 65.44,
      "end": 74.38,
      "text": " of people using the expression. Let's listen. Everyone looked really bored with my karaoke"
    },
    {
      "id": 13,
      "start": 74.47999999999999,
      "end": 79.34,
      "text": " song choices, but then I remembered I had a really good party song in my locker."
    },
    {
      "id": 14,
      "start": 79.44,
      "end": 84.06,
      "text": " Everyone got up and danced. I didn't realise you had those dance moves in your locker."
    },
    {
      "id": 15,
      "start": 84.16,
      "end": 87.18,
      "text": " I wouldn't have challenged you to a dance off if I'd known."
    },
    {
      "id": 16,
      "start": 87.28,
      "end": 91.42,
      "text": " So I've invited my colleagues over for dinner. They think I can't cook, but they're going to be"
    },
    {
      "id": 17,
      "start": 91.52,
      "end": 95.03999999999999,
      "text": " surprised because I've got some great pasta recipes in my locker."
    },
    {
      "id": 18,
      "start": 98.72,
      "end": 104.78,
      "text": " We've been learning the expression have in your locker. It means having something extra you can"
    },
    {
      "id": 19,
      "start": 104.88,
      "end": 112.06,
      "text": " use if needed. And there is a similar expression, to have one shot in your locker. This means you"
    },
    {
      "id": 20,
      "start": 112.16,
      "end": 117.26,
      "text": " only have one chance left to do something. Yes, think about researchers who've been trying to"
    },
    {
      "id": 21,
      "start": 117.36,
      "end": 123.58,
      "text": " make an experiment work and there's only one more chance to succeed. They would have one more shot"
    },
    {
      "id": 22,
      "start": 123.67999999999999,
      "end": 129.02,
      "text": " in their locker. Now, I'm sure you want to have some great English expressions in your locker."
    },
    {
      "id": 23,
      "start": 129.12,
      "end": 134.14,
      "text": " So make sure you come back next time to learn a new one. Bye. Bye."
    },
    {
      "id": 24,
      "start": 134.24,
      "end": 139.5,
      "text": " Hello. Want to improve your pronunciation? Our new video series, The Pronunciation Lounge,"
    },
    {
      "id": 25,
      "start": 139.60000000000002,
      "end": 144.46,
      "text": " helps you hear, recognise and produce English sounds, words and phrases."
    },
    {
      "id": 26,
      "start": 144.56,
      "end": 149.34,
      "text": " Find all the episodes on our website and practice your listening and speaking skills."
    }
  ]
}